000000 IDENTIFICATION DIVISION.                                         *
       PROGRAM-ID. IC109A.                                              *
       DATA DIVISION.                                                   *
       LINKAGE SECTION.                                                 *
           01  GRP-01.                                                  *
               COPY INCEPTION.                                          *

      *******************************************************************
      /                                                                 *
               02  SPECIAL-FLAGS.                                       *
                   03  DN7 PICTURE X.                                   *
                   03  DN8 PICTURE X.                                   *
                   03  DN9 PICTURE X.                                   *