       01 FLTCMT-COMMAREA.
          03 FLTCMT-EYE                 PIC X(4).
             88 FLTCMT-EYE-VALID        VALUE 'FLTC'.
          *> Input parameters (composite key)
          03 FLTCMT-SORTCODE            PIC 9(6).
          03 FLTCMT-ACCNO               PIC 9(8).
