000000         02  SUB-CALLED.
                   03  DN1  PICTURE X(6).
                   03  DN2  PICTURE X(6).
                   03  DN3  PICTURE X(6).