BIND PACKAGE(PROD0) OWNER(SBS100S) -
   QUALIFIER(SBS100S) MEMBER(IC201A) -
   SQLERROR(NOPACKAGE) VALIDATE(BIND) FLAG(I) ISOLATION(CS) -
   RELEASE(COMMIT) EXPLAIN(YES) CURRENTDATA(YES) -
   ACTION(ADD)     -
   ENABLE(*)
