BIND PLAN(LINKEDIT1) OWNER(SBS100S) -
   QUALIFIER(SBS100S) -
   PKLIST(PROD0.*)  -
   VALIDATE(BIND)        -
   FLAG(I) ISOLATION(CS) -
   CACHESIZE(0) -
   ACQUIRE(USE) -
   RELEASE(COMMIT) EXPLAIN(YES) CURRENTDATA(YES) -
   ACTION(REPLACE) RETAIN -
   ENABLE(*)
